USE PizzaHouseDB;
GO

INSERT INTO Users (username, email, password, role)
VALUES
(N'admin1', NULL, N'admin123', N'admin'),
(N'admin2', NULL, N'admin223', N'admin'),
(N'user1', N'user1@gmail.com', N'12345', N'user');
GO

INSERT INTO Pizzas (name, description, price, image)
VALUES
(N'Маргарита', N'помідор чері, моцарела, томатний соус, базилік, оливкова олія, пармезан', 169.00, N'margarita.jpg'),
(N'Капрічоза', N'шинка, печериці, маслини, помідор чері, томатний соус, моцарела, орегано, базилік', 245.00, N'kaprichosa.jpg'),
(N'Гавайська з креветкою', N'креветка тигрова, ананас, помідор чері, соус світ чилі, рукола, вершковий соус', 315.00, N'shrimp.jpg'),
(N'Тропікано', N'шинка, куряче філе, ананас, кукурудза, моцарела, вершковий соус', 235.00, N'tropicano.jpg'),
(N'Баварська', N'мисливські ковбаски, шинка, куряче філе, печериці, моцарела', 255.00, N'bavaria.jpg'),
(N'Груша & Dor Blue', N'груша, сир дор блю, кеш''ю, джем із інжиру', 265.00, N'pear.jpg'),
(N'Теріякі', N'куряче філе, болгарський перець, помідор черрі, моцарела, вершковий соус, кунжут, соус теріяки', 215.00, N'teriaci.jpg');
GO